module.exports = {
  E1001: "请求异常",

  E2001: "签名验证失败",
  E2002: "token验证失败",
  E2003: "请求地址错误",
  E2004: "token验证失败",
  E2005: "请求参数错误",
  E2006: "请求过期",
  E2008: "失效",
  E2009: "IP不合法",
  E2010: "验证码错误",
  E2011: "验证码过期",

  // trans
  E7001: "钱包地址错误",
  E7002: "数量错误",
  E7003: "数量异常",
  E7004: "钱包余额不足",
  E7005: "服务器异常",
  E7006: "服务器异常",

  // wallet
  E8001: "没有可归集钱包",
  E8002: "没有可更新钱包",
  E8003: "没有可用资金池钱包",
  E8004: "没有手续费钱包",
  E8005: "归集失败,请查看日志",
  E8006: "手续费钱包余额不足",

  // 
  EQ001: "当前服务器忙,请稍后再试",
  EQ002: "服务器异常",

};
